klasing/IR-Receiver_10-10-2022_v2/STM32-Win32_rs232_communication_13-11-2022_v1/STM32-Win32_rs232_communication_13-11-2022_v1.cpp
    return 0;
}

//****************************************************************************
//*                     DlgProc
//****************************************************************************
INT_PTR CALLBACK DlgProc(HWND hDlg, UINT uMsg, WPARAM wParam, LPARAM lParam)
{
    static HANDLE hThread = INVALID_HANDLE_VALUE;
    switch (uMsg)
	{
	case WM_INITDIALOG:
	{
		onWmInitDialog_DlgProc(g_hInst
            , hDlg
            , g_hWndStatusbar
		);

		return (INT_PTR)FALSE;
	} // eof WM_INITDIALOG
    case WM_SIZE:
    {
        onWmSize_DlgProc(hDlg, g_hWndStatusbar);
        return (INT_PTR)TRUE;
    } // eof WM_SIZE
    case WM_COMMAND:
    {
        onWmCommand_DlgProc(hDlg
            , wParam
            , hThread
            , g_hWndStatusbar
        );
        // this break is vital, otherwise a WM_COMMAND falls
        // through in the SET_TEXT_STATUSBAR message handler!
        break;
    } // eof WM_COMMAND
    case SET_TEXT_STATUSBAR:
    {
        // set message from thread into statusbar
        SendMessage(g_hWndStatusbar
            , SB_SETTEXT
            , (WPARAM)0 | SBT_POPOUT // don't care about SBT_POPOUT
            , (LPARAM)lParam
        );
        return (INT_PTR)TRUE;
    } // eof SET_TEXT_STATUSBAR
    } // eof switch

	return (INT_PTR)FALSE;
}

// Message handler for about box.
//****************************************************************************
//*                     About
//****************************************************************************
INT_PTR CALLBACK About(HWND hDlg, UINT message, WPARAM wParam, LPARAM lParam)
{
    UNREFERENCED_PARAMETER(lParam);
    switch (message)
    {
    case WM_INITDIALOG:
        return (INT_PTR)TRUE;

    case WM_COMMAND:
        if (LOWORD(wParam) == IDOK || LOWORD(wParam) == IDCANCEL)
        {
            EndDialog(hDlg, LOWORD(wParam));
            return (INT_PTR)TRUE;
        }
        break;
    }
    return (INT_PTR)FALSE;
}

/*
// STM32-Win32_rs232_communication_13-11-2022_v1.cpp : Defines the entry point for the application.
//

#include "framework.h"
#include "STM32-Win32_rs232_communication_13-11-2022_v1.h"

#define MAX_LOADSTRING 100

//****************************************************************************
//*                     typedef
//*
//* when writing to the device, the device will respond with OK in the payload
//* O=79 0x4F 0100 1111
//* K=75 0x4B 0100 1011
//* payload=0x4F4B
//****************************************************************************
typedef struct tagFRAME
{
    const CHAR soh;
    UINT16 cmnd;
    const CHAR stx;
    INT16 payload;
    const CHAR etx;
    const CHAR etb;
    const CHAR eot;
} FRAME, *PFRAME;

// Global Variables:
HINSTANCE g_hInst;                                // current instance
WCHAR szTitle[MAX_LOADSTRING];                  // The title bar text
WCHAR szWindowClass[MAX_LOADSTRING];            // the main window class name

HWND g_hDlg = { 0 };
HANDLE g_hComm = INVALID_HANDLE_VALUE;
//BOOL g_bTransmit = TRUE;
volatile BOOL g_bContinueTxRx = TRUE;
volatile UINT16 g_iCommand = RD_REG_0;
volatile UINT8 g_nReg = 0;
volatile BOOL g_bRead = TRUE;
volatile FRAME g_oFrame = { SOH, 0, STX, 0, ETX, ETB, EOT }; // RAII
CHAR g_chBuffer[BUFFER_MAX_SERIAL] = { 0 };

// Forward declarations of functions included in this code module:
ATOM                MyRegisterClass(HINSTANCE hInstance);
BOOL                InitInstance(HINSTANCE, int);
LRESULT CALLBACK    WndProc(HWND, UINT, WPARAM, LPARAM);
INT_PTR CALLBACK    About(HWND, UINT, WPARAM, LPARAM);
INT_PTR CALLBACK    DlgProc(HWND hDlg, UINT uMsg, WPARAM wParam, LPARAM lParam);
BOOL                connect(HANDLE& hComm);
DWORD WINAPI        TxRx(LPVOID lpVoid);
BOOL                transmit();
BOOL                receive(LPVOID lpVoid);
BOOL                determineCmnd();
//DWORD WINAPI        transmit(LPVOID lpVoid);
//DWORD WINAPI        receive(LPVOID lpVoid);

BOOL bBkMustBeRed = FALSE;

int APIENTRY wWinMain(_In_ HINSTANCE hInstance,
                     _In_opt_ HINSTANCE hPrevInstance,
                     _In_ LPWSTR    lpCmdLine,
                     _In_ int       nCmdShow)
{
    UNREFERENCED_PARAMETER(hPrevInstance);
    UNREFERENCED_PARAMETER(lpCmdLine);

    // TODO: Place code here.

    // Initialize global strings
    LoadStringW(hInstance, IDS_APP_TITLE, szTitle, MAX_LOADSTRING);
    LoadStringW(hInstance, IDC_STM32WIN32RS232COMMUNICATION13112022V1, szWindowClass, MAX_LOADSTRING);
    MyRegisterClass(hInstance);

    // Perform application initialization:
    if (!InitInstance (hInstance, nCmdShow))
    {
        return FALSE;
    }

    HACCEL hAccelTable = LoadAccelerators(hInstance, MAKEINTRESOURCE(IDC_STM32WIN32RS232COMMUNICATION13112022V1));

    MSG msg;

    // Main message loop:
    while (GetMessage(&msg, nullptr, 0, 0))
    {
        if (IsDialogMessage(g_hDlg, &msg))
        {
            continue;
        }
        if (!TranslateAccelerator(msg.hwnd, hAccelTable, &msg))
        {
            TranslateMessage(&msg);
            DispatchMessage(&msg);
        }
    }

    return (int) msg.wParam;
}

//
//  FUNCTION: MyRegisterClass()
//
//  PURPOSE: Registers the window class.
//
ATOM MyRegisterClass(HINSTANCE hInstance)
{
    WNDCLASSEXW wcex;

    wcex.cbSize = sizeof(WNDCLASSEX);

    wcex.style          = CS_HREDRAW | CS_VREDRAW;
    wcex.lpfnWndProc    = WndProc;
    wcex.cbClsExtra     = 0;
    wcex.cbWndExtra     = 0;
    wcex.hInstance      = hInstance;
    wcex.hIcon          = LoadIcon(hInstance, MAKEINTRESOURCE(IDI_STM32WIN32RS232COMMUNICATION13112022V1));
    wcex.hCursor        = LoadCursor(nullptr, IDC_ARROW);
    wcex.hbrBackground  = (HBRUSH)(COLOR_WINDOW+1);
    wcex.lpszMenuName   = MAKEINTRESOURCEW(IDC_STM32WIN32RS232COMMUNICATION13112022V1);
    wcex.lpszClassName  = szWindowClass;
    wcex.hIconSm        = LoadIcon(wcex.hInstance, MAKEINTRESOURCE(IDI_SMALL));

    return RegisterClassExW(&wcex);
}

//
//   FUNCTION: InitInstance(HINSTANCE, int)
//
//   PURPOSE: Saves instance handle and creates main window
//
//   COMMENTS:
//
//        In this function, we save the instance handle in a global variable and
//        create and display the main program window.
//
BOOL InitInstance(HINSTANCE hInstance, int nCmdShow)
{
   g_hInst = hInstance; // Store instance handle in our global variable

   HWND hWnd = CreateWindowW(szWindowClass, szTitle, WS_OVERLAPPEDWINDOW
	   , 15
	   , 15
	   , 370
	   , 300
	   , nullptr, nullptr, hInstance, nullptr);

   if (!hWnd)
   {
      return FALSE;
   }

