klasing/IR-Receiver_10-10-2022_v2/STM32-Win32_rs232_communication_13-11-2022_v1/STM32-Win32_rs232_communication_13-11-2022_v1.cpp
   ShowWindow(hWnd, nCmdShow);
   UpdateWindow(hWnd);

   return TRUE;
}

//
//  FUNCTION: WndProc(HWND, UINT, WPARAM, LPARAM)
//
//  PURPOSE: Processes messages for the main window.
//
//  WM_COMMAND  - process the application menu
//  WM_PAINT    - Paint the main window
//  WM_DESTROY  - post a quit message and return
//
//
//****************************************************************************
//*                     WndProc
//****************************************************************************
LRESULT CALLBACK WndProc(HWND hWnd, UINT message, WPARAM wParam, LPARAM lParam)
{
    switch (message)
    {
    case WM_NCCREATE:
    {
        // create dialog
        g_hDlg = CreateDialog(g_hInst, L"DLGPROCWINDOW", hWnd, DlgProc);
        return DefWindowProc(hWnd, message, wParam, lParam);
    } // eof WM_NCCREATE
    case WM_SIZE:
    {
        RECT rect;
        GetClientRect(hWnd, &rect);
        // sset size dialog and show dialog
        SetWindowPos(g_hDlg
            , HWND_TOP
            , rect.left
            , rect.top
            , rect.right
            , rect.bottom
            , SWP_SHOWWINDOW
        );
        return (INT_PTR)TRUE;
    } // eof WM_SIZE
    case WM_COMMAND:
        {
            int wmId = LOWORD(wParam);
            // Parse the menu selections:
            switch (wmId)
            {
            case IDM_ABOUT:
                DialogBox(g_hInst, MAKEINTRESOURCE(IDD_ABOUTBOX), hWnd, About);
                break;
            case IDM_EXIT:
                DestroyWindow(hWnd);
                break;
            default:
                return DefWindowProc(hWnd, message, wParam, lParam);
            }
        }
        break;
	case WM_PAINT:
	{
		PAINTSTRUCT ps;
		HDC hdc = BeginPaint(hWnd, &ps);
		// TODO: Add any drawing code that uses hdc here...
		EndPaint(hWnd, &ps);
	}
	break;
    case WM_DESTROY:
        PostQuitMessage(0);
        break;
    default:
        return DefWindowProc(hWnd, message, wParam, lParam);
    }
    return 0;
}

//****************************************************************************
//*                     DlgProc
//****************************************************************************
INT_PTR CALLBACK DlgProc(HWND hDlg, UINT uMsg, WPARAM wParam, LPARAM lParam)
{
    //static HANDLE hComm = INVALID_HANDLE_VALUE;
    //static BOOL bBkMustBeRed = FALSE;
    switch (uMsg)
    {
    case WM_INITDIALOG:
    {
        // set text edit control IDC_STATUS
        SendMessage(GetDlgItem(hDlg, IDC_STATUS_SERIAL)
            , WM_SETTEXT
            , (WPARAM)0
            , (LPARAM)L"Disconnected"
        );
        // populate combobox IDC_CB_REGISTER
        SendMessage(GetDlgItem(hDlg, IDC_CB_REGISTER)
            , CB_ADDSTRING
            , (WPARAM)0
            , (LPARAM)L"0"
        );
        SendMessage(GetDlgItem(hDlg, IDC_CB_REGISTER)
            , CB_ADDSTRING
            , (WPARAM)0
            , (LPARAM)L"1"
        );
        SendMessage(GetDlgItem(hDlg, IDC_CB_REGISTER)
            , CB_ADDSTRING
            , (WPARAM)0
            , (LPARAM)L"2"
        );
        // set the default value for the IDC_CB_REGISTER
        SendMessage(GetDlgItem(hDlg, IDC_CB_REGISTER)
            , CB_SETCURSEL
            , (WPARAM)0
            , (LPARAM)0
        );
        // check IDC_RB_READ
        CheckRadioButton(hDlg
            , IDC_RB_WRITE
            , IDC_RB_READ
            , IDC_RB_READ
        );
        // disable edit control IDC_TRANSMIT
        EnableWindow(GetDlgItem(hDlg, IDC_TRANSMIT), FALSE);
        return (INT_PTR)FALSE;
    } // eof WM_INITDIALOG
    case WM_COMMAND:
    {
        switch (LOWORD(wParam))
        {
        case IDC_CONNECT:
        {
            if (connect(g_hComm) == EXIT_SUCCESS)
            {
                g_bContinueTxRx = TRUE;

                // set text edit control IDC_STATUS
                SendMessage(GetDlgItem(hDlg, IDC_STATUS_SERIAL)
                    , WM_SETTEXT
                    , (WPARAM)0
                    , (LPARAM)L"Connected"
                );
                // enable/disable button
                EnableWindow(GetDlgItem(hDlg, IDC_CONNECT), FALSE);
                EnableWindow(GetDlgItem(hDlg, IDC_DISCONNECT), TRUE);

                // set g_oFrame into the default state
                g_oFrame.cmnd = 33600;

				// create/start thread to continuously transmit and receive
				DWORD dwThreadIdTxRx = 0;
				HANDLE hTreadTxRx = CreateThread(NULL
					, 0
					, TxRx
					, (LPVOID)hDlg
					, CREATE_SUSPENDED // wait until started
					, &dwThreadIdTxRx
				);
                // start thread exact on this command
                if (hTreadTxRx) ResumeThread(hTreadTxRx);
                //// create thread to transmit
                //DWORD dwThreadIdTransmit = 0;
                //HANDLE hTreadTransmit = CreateThread(NULL
                //    , 0
                //    , transmit
                //    , (LPVOID)hDlg
                //    , 0
                //    , &dwThreadIdTransmit
                //);

                //// create thread to receive
                //DWORD dwThreadIdReceive = 0;
                //HANDLE hTreadReceive = CreateThread(NULL
                //    , 0
                //    , receive
                //    , (LPVOID)hDlg
                //    , 0
                //    , &dwThreadIdReceive
                //);
            }
            return (INT_PTR)TRUE;
        } // eof IDC_CONNECT
        case IDC_RB_WRITE:
        {
            g_bRead = FALSE;
            // enable edit control IDC_TRANSMIT
            EnableWindow(GetDlgItem(hDlg, IDC_TRANSMIT), TRUE);
            return (INT_PTR)TRUE;
        } // IDC_RB_WRITE;
        case IDC_RB_READ:
        {
            g_bRead = TRUE;
            // disable edit control IDC_TRANSMIT
            EnableWindow(GetDlgItem(hDlg, IDC_TRANSMIT), FALSE);
            return (INT_PTR)TRUE;
        } // IDC_RB_READ;
        case IDC_DISCONNECT:
        {
            if (g_hComm == INVALID_HANDLE_VALUE) return (INT_PTR)TRUE;
            if (CloseHandle(g_hComm))
            {
                g_bContinueTxRx = FALSE;

                g_hComm = INVALID_HANDLE_VALUE;

                // set text edit control IDC_STATUS
                SendMessage(GetDlgItem(hDlg, IDC_STATUS_SERIAL)
                    , WM_SETTEXT
                    , (WPARAM)0
                    , (LPARAM)L"Disconnected"
                );

