klasing/IR-Receiver_10-10-2022_v2/STM32-Win32_rs232_communication_13-11-2022_v1/STM32-Win32_rs232_communication_13-11-2022_v1.cpp
                // enable/disable button
                EnableWindow(GetDlgItem(hDlg, IDC_CONNECT), TRUE);
                EnableWindow(GetDlgItem(hDlg, IDC_DISCONNECT), FALSE);
            }
            return (INT_PTR)TRUE;
        } // eof IDC_DISCONNECT
        } // eof switch
        switch (HIWORD(wParam))
        {
        case CBN_SELCHANGE:
        {
            g_nReg = SendMessage((HWND)lParam
                , CB_GETCURSEL
                , (WPARAM)0
                , (LPARAM)0
            );
            return (INT_PTR)TRUE;
        } // eof CBN_SELCHANGE
        //case EN_CHANGE:
        //{
        //    if (LOWORD(wParam) == IDC_RECEIVE)
        //    {
        //        OutputDebugString(L"EN_CHANGE IDC_RECEIVE\n");
        //        bBkMustBeRed = !bBkMustBeRed;
        //        InvalidateRect(hDlg, NULL, TRUE);
        //    }
        //} // eof EN_CHANGE
        } // eof switch
        return (INT_PTR)FALSE;
    }  // eof WM_COMMAND
    //case WM_CTLCOLOREDIT:
    //{
    //    HBRUSH hBrush;
    //    if (bBkMustBeRed)
    //    {
    //        SetBkColor(GetDC(hDlg), RGB(0xFF, 0, 0));
    //        hBrush = CreateSolidBrush(RGB(0xFF, 0, 0));
    //    }
    //    else
    //    {
    //        SetBkColor(GetDC(hDlg), RGB(0, 0xFF, 0));
    //        hBrush = CreateSolidBrush(RGB(0, 0xFF, 0));
    //    }
    //    return (LRESULT)hBrush;
    //} // eof WM_CTLCOLOREDIT
    //case WM_PAINT:
    //{
    //    HBRUSH hBrush;
    //    if (bBkMustBeRed)
    //    {
    //        hBrush = CreateSolidBrush(RGB(0xFF, 0, 0));
    //    }
    //    else
    //    {
    //        hBrush = CreateSolidBrush(RGB(0, 0xFF, 0));
    //    }
    //    PAINTSTRUCT ps;
    //    HDC hdc = BeginPaint(hDlg, &ps);
    //    SelectObject(hdc, hBrush);
    //    Rectangle(hdc, 300, 123, 315, 138);
    //    EndPaint(hDlg, &ps);
    //    //return (INT_PTR)TRUE;
    //    return (INT_PTR)FALSE;
    //} // eof WM_PAINT 
    } // eof switch
    return (INT_PTR)FALSE;
}

//****************************************************************************
//*                     connect
//****************************************************************************
BOOL connect(HANDLE& hComm)
{
    // create file
    hComm = CreateFile(L"\\\\.\\COM3"
        , GENERIC_READ | GENERIC_WRITE
        , 0
        , NULL
        , OPEN_EXISTING
        , FILE_ATTRIBUTE_NORMAL // synchronous I/O
        , NULL
    );
    if (hComm == INVALID_HANDLE_VALUE)
    {
        return EXIT_FAILURE;
    }

    // set structure to initialize the communication port
    DCB dcb;
    dcb.DCBlength = sizeof(DCB);
    dcb.BaudRate = 115200;
    dcb.fBinary = 1;
    dcb.fParity = 0;
    dcb.fOutxCtsFlow = 0;
    dcb.fOutxDsrFlow = 0;
    dcb.fDtrControl = 1;
    dcb.fDsrSensitivity = 0;
    dcb.fTXContinueOnXoff = 0;
    dcb.fOutX = 0;
    dcb.fInX = 0;
    dcb.fErrorChar = 0;
    dcb.fNull = 0;
    dcb.fRtsControl = 1;
    dcb.fAbortOnError = 0;
    dcb.fDummy2 = 0;
    dcb.wReserved = 0;
    dcb.ByteSize = 8;
    dcb.Parity = 0;
    dcb.StopBits = 0;
    dcb.XoffChar = 0;
    dcb.XoffChar = 0;
    dcb.ErrorChar = 24;
    dcb.EvtChar = 0;
    dcb.wReserved1 = 0;
    dcb.ByteSize = 8;
    dcb.StopBits = 0;
    // initialize the communication port
    if (!SetCommState(hComm, (LPDCB)&dcb))
    {
        return EXIT_FAILURE;
    }

    // set structure for the communication port timeout
    COMMTIMEOUTS commtimeouts;
    commtimeouts.ReadIntervalTimeout = MAXDWORD;
    commtimeouts.ReadTotalTimeoutMultiplier = 0;
    commtimeouts.ReadTotalTimeoutConstant = 0;
    commtimeouts.WriteTotalTimeoutMultiplier = 0;
    commtimeouts.WriteTotalTimeoutConstant = 0;
    // set communication port timeout
    if (!SetCommTimeouts(hComm, (LPCOMMTIMEOUTS)&commtimeouts))
    {
        return EXIT_FAILURE;
    }

    // set the communication port mask bit to capture event
    if (!SetCommMask(hComm, EV_TXEMPTY | EV_RXCHAR))
    {
        return EXIT_FAILURE;
    }

    // set in/out queue buffers
    if (!SetupComm(hComm, BUFFER_MAX_SERIAL, BUFFER_MAX_SERIAL))
    {
        return EXIT_FAILURE;
    }

    return EXIT_SUCCESS;
}

//****************************************************************************
//*                     TxRx
//****************************************************************************
DWORD WINAPI TxRx(LPVOID lpVoid)
{
    // infinite loop
    while (g_bContinueTxRx)
    {
        transmit();
        Sleep(DELAY_DFLT_SERIAL);
        receive(lpVoid);
        Sleep(DELAY_DFLT_SERIAL);
    }
    return 0;
}

//****************************************************************************
//*                     transmit
//****************************************************************************
BOOL transmit()
{
    OutputDebugString(L"transmitting\n");
    determineCmnd();
    sprintf_s((CHAR*)g_chBuffer, (size_t)BUFFER_MAX_SERIAL, "%c%c%c%c%c%c%c%c%c"
        , g_oFrame.soh
        , (g_oFrame.cmnd >> 8) & 0xFF
        , (g_oFrame.cmnd & 0xFF)
        , g_oFrame.stx
        , (g_oFrame.payload >> 8) & 0xFF
        , (g_oFrame.payload & 0xFF)
        , g_oFrame.etx
        , g_oFrame.etb
        , g_oFrame.eot
    );
    DWORD dwNofByteTransferred = 0;
    WriteFile(g_hComm
        , &g_chBuffer
        , LEN_FRAME
        , &dwNofByteTransferred
        , NULL
    );
    return EXIT_SUCCESS;
}

//****************************************************************************
//*                     receive
//****************************************************************************
BOOL receive(LPVOID lpVoid)
{
    OutputDebugString(L"receiving\n");
    DWORD dwNofByteTransferred = 0;
    ReadFile(g_hComm
        , &g_chBuffer
        , LEN_FRAME
        , &dwNofByteTransferred
        , NULL
    );
    g_oFrame.cmnd = (g_chBuffer[1] << 8) | (g_chBuffer[2]);
    g_oFrame.payload = (g_chBuffer[4] << 8) | (g_chBuffer[5]);
    std::string str = "";
    if (g_bRead)
    {
        // expect a numerical value
        str = std::to_string(g_oFrame.payload);
    }
    else
    {
        // expect a char string representing an 'OK'
        str += g_chBuffer[4];
        str += g_chBuffer[5];
    }
    SendMessageA(GetDlgItem((HWND)lpVoid, IDC_RECEIVE)
        , WM_SETTEXT
        , (WPARAM)0
        , (LPARAM)str.c_str()
    );
    return EXIT_SUCCESS;
}
//****************************************************************************
//*                     determineCmnd
//****************************************************************************
BOOL determineCmnd()
{
    // payload
    CHAR chBuffer[10] = { 0 };
    SendMessageA(GetDlgItem(g_hDlg, IDC_TRANSMIT)
        , WM_GETTEXT
        , (WPARAM)10
        , (LPARAM)chBuffer
    );
    if (strlen(chBuffer) == 0)
    {
        g_oFrame.payload = 0;
    }
    else
    {
        g_oFrame.payload = atoi(chBuffer);
    }

    // cmnd
    if (g_nReg == 0)
    {
        if (g_bRead)
        {
            g_oFrame.cmnd = RD_REG_0;
        }
        else
        {
            g_oFrame.cmnd = WR_REG_0;
        }
        return EXIT_SUCCESS;
    }
    if (g_nReg == 1)
    {
        if (g_bRead)
        {
            g_oFrame.cmnd = RD_REG_1;
        }
        else
        {
            g_oFrame.cmnd = WR_REG_1;
        }
        return EXIT_SUCCESS;
    }
    if (g_nReg == 2)
    {
        if (g_bRead)
        {
            g_oFrame.cmnd = RD_REG_2;
        }
        else
        {
            g_oFrame.cmnd = WR_REG_2;
        }
        return EXIT_SUCCESS;
    }
    return EXIT_FAILURE;
}
//****************************************************************************
//*                     transmit
//****************************************************************************
//DWORD WINAPI transmit(LPVOID lpVoid)
//{
//    CHAR chBuffer[BUFFER_MAX_SERIAL] = { 0 };
//    sprintf_s(chBuffer, BUFFER_MAX_SERIAL, "33603");
//    DWORD dwNofByteTransferred = 0;
//    BOOL bResult = FALSE;
//    // infinite loop
//    while (TRUE)
//    {
//        if (g_bTransmit)
//        {
//            bResult = WriteFile(g_hComm
//                , &chBuffer
//                , 5
//                , &dwNofByteTransferred
//                , NULL
//            );
//            OutputDebugStringA(chBuffer);
//            OutputDebugString(L" ");
//            Sleep(125);
//            g_bTransmit = FALSE;
//        }
//    }
//    return 0;
//}

//****************************************************************************
//*                     receive
//****************************************************************************
//DWORD WINAPI receive(LPVOID lpVoid)
//{
//    CHAR chBuffer[BUFFER_MAX_SERIAL] = { 0 };
//    DWORD dwNofByteTransferred = 0;
//    BOOL bResult = FALSE;
//    // infinite loop
//    while (TRUE)
//    {
//        if (!g_bTransmit)
//        {
//            bResult = ReadFile(g_hComm
//                , &chBuffer
//                , 2//strlen(chBuffer)
//                , &dwNofByteTransferred
//                , NULL
//            );
//            OutputDebugStringA(chBuffer);
//            OutputDebugString(L"\n");
//            Sleep(125);
//            g_bTransmit = TRUE;
//        }
//    }
//    return 0;
//}

// Message handler for about box.
INT_PTR CALLBACK About(HWND hDlg, UINT message, WPARAM wParam, LPARAM lParam)
{
    UNREFERENCED_PARAMETER(lParam);
    switch (message)
    {
    case WM_INITDIALOG:
        return (INT_PTR)TRUE;

    case WM_COMMAND:
        if (LOWORD(wParam) == IDOK || LOWORD(wParam) == IDCANCEL)
        {
            EndDialog(hDlg, LOWORD(wParam));
            return (INT_PTR)TRUE;
        }
        break;
    }
    return (INT_PTR)FALSE;
}
*/